---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerType.CreateDefaultRebarContainerType(Autodesk.Revit.DB.Document)
source: html/ab6426b6-47c4-34df-79ec-4e2f56445f2c.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerType.CreateDefaultRebarContainerType Method

Creates a new RebarContainerType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultRebarContainerType(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null